linux/paperwork/linux-exam-outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《Linux应用基础》考核大纲</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《Linux应用基础》考核大纲"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-30 Fri"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《Linux应用基础》考核大纲</h1>

<ul>
<li>课程编号：A05010, A05011
</li>
<li>课程名称：Linux应用基础
</li>
<li>任课教师：王晓林
</li>
<li>适应专业：电信、信计、计算机等本科专业
</li>
<li>授课学时：32/48
</li>
<li>考试方式：闭卷机试
</li>
<li>命题规则：按《西南林学院考试命题规则》(试行)(1996年10月修订)执行
</li>
<li>考试时间：120分钟
</li>
<li>推荐教材：《Advanced Bash Scripting Guide》
</li>
<li>课程性质及教学目的：本课为通信和计算机专业的选修课. 通过学习, 要求学生全面了解Linux系统的工作环境，学会在Linux下完成日常工作和开发工作。
</li>
</ul>


<p>  
各章节考核目标如下：
</p>
<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 GNU/Linux简介</a>
<ul>
<li><a href="#sec-1-1">1.1 考核知识点</a></li>
<li><a href="#sec-1-2">1.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Shell基础</a>
<ul>
<li><a href="#sec-2-1">2.1 考核知识点</a></li>
<li><a href="#sec-2-2">2.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-3">3 常用软件工具</a>
<ul>
<li><a href="#sec-3-1">3.1 考核知识点</a></li>
<li><a href="#sec-3-2">3.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-4">4 软件开发环境</a>
<ul>
<li><a href="#sec-4-1">4.1 考核知识点</a></li>
<li><a href="#sec-4-2">4.2 考核要求</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Debian GNU/Linux系统管理</a>
<ul>
<li><a href="#sec-5-1">5.1 考核知识点</a></li>
<li><a href="#sec-5-2">5.2 考核要求</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> GNU/Linux简介</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>UNIX, GNU, Linux的诞生、创始人
</li>
<li>开源软件 
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>了解UNIX, GNU, Linux的基本历史常识
</li>
<li>了解开源软件
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Shell基础</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>UNIX文件系统基本结构
</li>
<li>路径、目录、特殊文件
</li>
<li>常用的命令行命令
</li>
<li>Shell编程
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>理解UNIX文件系统目录结构
</li>
<li>熟悉常用命令：ls, cd, pwd, cp, rm, man, help, ln, cat, less, mkdir&hellip;
</li>
<li>会编简单的程序
</li>
<li>能看懂复杂的程序
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 常用软件工具</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>编辑器: emacs, vim
</li>
<li>网络工具: firefox, lftp, wget, mutt, pidgin &hellip;
</li>
<li>办公自动化: openoffice.org
</li>
<li>图像处理: gimp, imagemagick, dia, xfig, inkscape, hugin
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>能熟练使用emacs和vim
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 软件开发环境</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>GCC
</li>
<li>make
</li>
<li>gdb
</li>
<li>可视化编程: Qt4, glade, gambas, Tcl/Tk
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>了解GCC, Makefile, GDB的使用
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Debian GNU/Linux系统管理</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 考核知识点</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>最小系统的安装
</li>
<li>apt
</li>
<li>Debian 管理工具
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 考核要求</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>会安装系统
</li>
<li>会安装、卸载软件
</li>
<li>会更新系统和软件
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2012-11-30 Fri</p>

</div>
</body>
</html>
